app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
  	@post_images = @user.post_images.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images" WHERE "post_images"."user_id" = ?  [["user_id", 1]]

  def update
  	 @user = User.find(params[:id])
     @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "4848c85ee1cde31a1a2e339972e9cf48c1ecec22f22269e6a39601e2d024"], ["updated_at", "2020-03-12 10:28:24.591017"], ["id", 1]]